zup/ЗУП_бюджет/src/Enums/ОтношениеНачисленийКДенежномуДовольствию/ОтношениеНачисленийКДенежномуДовольствию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтношениеНачисленийКДенежномуДовольствию</name>
  <enumValues>
    <name>ОкладПоВоинскойДолжности</name>
    <comment>Только для военнослужащих</comment>
  </enumValues>
  <enumValues>
    <name>ОкладПоВоинскомуЗванию</name>
    <comment>Только для военнослужащих</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеВыплаты</name>
  </enumValues>
  <enumValues>
    <name>ДолжностнойОклад</name>
    <comment>Только для сотрудников</comment>
  </enumValues>
  <enumValues>
    <name>ОкладПоСпециальномуЗванию</name>
    <comment>Только для сотрудников</comment>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаВыслугуЛет</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаКласснуюКвалификацию</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаСекретность</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаОсобыеУсловияСлужбы</name>
  </enumValues>
  <enumValues>
    <name>ПремияЗаДобросовестноеВыполнениеСлужебныхОбязанностей</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаСтажСлужбы</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаКвалификационноеЗвание</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ОтношениеНачисленийКДенежномуДовольствию/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ГосударственнаяСлужбаВызовСервера.ОтношениеНачисленийКДенежномуДовольствиюОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеЗначения() Экспорт
	
	ДоступныеЗначения = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасчетДенежногоДовольствияВоеннослужащих") Тогда
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ОкладПоВоинскойДолжности);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ОкладПоВоинскомуЗванию);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаВыслугуЛет);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаКласснуюКвалификацию);
	Иначе
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ДолжностнойОклад);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ОкладПоСпециальномуЗванию);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаСтажСлужбы);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаКвалификационноеЗвание);
	КонецЕсли;
	
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаСекретность);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.НадбавкаЗаОсобыеУсловияСлужбы);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ПремияЗаДобросовестноеВыполнениеСлужебныхОбязанностей);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуДовольствию.ЗначенияПеречисления.ПрочиеВыплаты);   
	
	Возврат ДоступныеЗначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
